hypothesis-notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="./rss.xml"
      title="RSS feed for ./"/>
<title>Hypothesis Notes</title>
<meta name="referrer" content="no-referrer">
<link href="static/sanitize@11.0.0.css" rel="stylesheet" />
<link href= "static/style.css" rel="stylesheet" type="text/css" />

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.11.1/dist/katex.min.css" integrity="sha384-zB1R0rpPzHqg7Kpt0Aljp8JPLqbXI3bhnPWROx27a9N0Ll6ZP/+DiW/UqRcLbRjq" crossorigin="anonymous">

<link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status">
<div class="header">
</div></div>
<div id="content">
<div class="post-date">18 May 2020</div><h1 class="post-title"><a href="./hypothesis-notes.html">Hypothesis Notes</a></h1>
<p>
I want to write several posts on solving various Leetcode problems. There I need to benchmark different solutions. And for that I need to have test cases. I could scrape them from Leetcode itself, but I thought it would be a perfect moment to learn <a href="https://hypothesis.readthedocs.io/en/latest/">Hypothesis</a>, that has already been on my radar for several years.
</p>

<p>
This post is basically a summary of the documentation.
</p>

<div id="outline-container-org81309a0" class="outline-2">
<h2 id="org81309a0">What&rsquo;s Hypothesis?</h2>
<div class="outline-text-2" id="text-org81309a0">
<blockquote>
<p>
Hypothesis is a Python library for creating unit tests which are simpler to write and more powerful when run, finding edge cases in your code you wouldn’t have thought to look for.
</p>
</blockquote>

<blockquote>
<p>
Hypothesis lets you write tests which instead look like this:
</p>

<ol class="org-ol">
<li>For all data matching some specification. (Instead of setting up some data manually.)</li>
<li>Perform some operations on the data.</li>
<li>Assert something about the result.</li>
</ol>

<p>
This is often called property-based testing, and was popularised by the Haskell library <a href="https://hackage.haskell.org/package/QuickCheck">Quickcheck</a>.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgea62e3a" class="outline-2">
<h2 id="orgea62e3a">Quick start guide</h2>
</div>

<div id="outline-container-org3ea7c54" class="outline-2">
<h2 id="org3ea7c54">Hypothesis Internals</h2>
<div class="outline-text-2" id="text-org3ea7c54">
<p>
There&rsquo;s a <a href="https://news.ycombinator.com/item?id=15150162">comment</a> on HN by <a href="https://www.drmaciver.com/">David MacIver</a>, the author of Hypothesis, comparing the project to QuickCheck, a Haskell project, that originally was an inspiration to David.
</p>
</div>
</div>
<div class="taglist"><a href="./tags.html">Tags</a>: <a href="./tag-python.html">python</a> </div></div>
<div id="postamble" class="status"><div id="archive">
</div></div>
</body>
</html>
